app/controllers/threads_controller.rb

SELECT * FROM `threads` ORDER BY last_post_at DESC LIMIT 0, 50
SELECT count(*) AS count_all FROM `threads`
---
  def index
    @threads = BBSThread.paginate :page => @page, :order => 'last_post_at DESC'

SELECT * FROM `threads` WHERE (`threads`.`id` = 842)
---
  def load_thread
    @thread = BBSThread.find(params[:id])